#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_api_management_api.to_do_api will be created
  + resource "azurerm_api_management_api" "to_do_api" {
      + api_management_name   = "dx-d-itn-playground-pg-apim-01"
      + api_type              = (known after apply)
      + description           = "To Do List API"
      + display_name          = "To Do API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "To Do API"
      + path                  = "api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "dx-d-itn-test-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                components:
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_key_vault_secret.admin_password will be destroyed
  # (because azurerm_key_vault_secret.admin_password is not in configuration)
  - resource "azurerm_key_vault_secret" "admin_password" {
      - id                      = "https://dx-d-itn-common-kv-01.vault.azure.net/secrets/dynatrace-vms-admin-password/5a830642fc6f4e46be6587206674af75" -> null
      - key_vault_id            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-d-itn-common-kv-01" -> null
      - name                    = "dynatrace-vms-admin-password" -> null
      - resource_id             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-d-itn-common-kv-01/secrets/dynatrace-vms-admin-password/versions/5a830642fc6f4e46be6587206674af75" -> null
      - resource_versionless_id = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-d-itn-common-kv-01/secrets/dynatrace-vms-admin-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "5a830642fc6f4e46be6587206674af75" -> null
      - versionless_id          = "https://dx-d-itn-common-kv-01.vault.azure.net/secrets/dynatrace-vms-admin-password" -> null
        # (1 unchanged attribute hidden)
    }

  # random_password.admin_password will be destroyed
  # (because random_password.admin_password is not in configuration)
  - resource "random_password" "admin_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
